---
kind: property
id: P:Autodesk.Revit.DB.MaterialNode.Glossiness
source: html/d1089082-8ea7-65d7-7a9e-d396085d595a.htm
---
# Autodesk.Revit.DB.MaterialNode.Glossiness Property

The level of glossiness of the material

## Syntax (C#)
```csharp
public int Glossiness { get; }
```